-- Гнучкість даних JSON дозволяє зберігати структуровані дані без вимог до фіксованої схеми бази даних. 
-- Ти можеш зберігати дані з різною структурою в одному стовпці, що дозволяє легко зберігати набори даних з різноманітною структурою, які можуть змінюватися з часом.
-- 
-- Інтеграція із застосунками JSON є популярним форматом для обміну даними між різними застосунками і системами. 
-- Використання JSON в базі даних дозволяє легко обмінюватися даними з іншими застосунками та вебсервісами, що підтримують JSON.

 select *
 from public.orders o
;
 
 select *
 from "HR".orders o 
 ;
  
-- розкриваэмо з ключами
 select 
  id, 
  info,
  json_object_keys(info) as json_key --ключі JSON-об'єкта з кожного рядка таблиці
 from "HR".orders e 
;

SELECT 
  id,
  info,
  info -> 'items' AS json_values, --повертає значення ключа 'items' у форматі JSON.
  json_object_keys(info -> 'items') AS json_key2, -- повертає ключі об'єкта, який міститься у ключі 'items'.
  (info ->> 'items') AS  text_values, --повертає значення ключа 'items' у форматі тексту.
  (info -> 'items' ->> 'product') AS product_name --повертає значення ключа 'product', яке знаходиться всередині об'єкта, який міститься у ключі 'items'.
FROM "HR".orders e
;

 select 
  id, 
  info, 
  info -> 'items' -> 'qty' as json_values
 from "HR".orders e
 ;
